weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxMtu_reg.h
/** \brief 362, Read Data and Bit Flip Register 1 */
#define MTU_MC3_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061362u)

/** \brief 364, Read Data and Bit Flip Register 2 */
#define MTU_MC3_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061364u)

/** \brief 366, Read Data and Bit Flip Register 3 */
#define MTU_MC3_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061366u)

/** \brief 368, Read Data and Bit Flip Register 4 */
#define MTU_MC3_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061368u)

/** \brief 36A, Read Data and Bit Flip Register 5 */
#define MTU_MC3_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006136Au)

/** \brief 36C, Read Data and Bit Flip Register 6 */
#define MTU_MC3_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006136Cu)

/** \brief 36E, Read Data and Bit Flip Register 7 */
#define MTU_MC3_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006136Eu)

/** \brief 370, Read Data and Bit Flip Register 8 */
#define MTU_MC3_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061370u)

/** \brief 372, Read Data and Bit Flip Register 9 */
#define MTU_MC3_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061372u)

/** \brief 374, Read Data and Bit Flip Register 10 */
#define MTU_MC3_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061374u)

/** \brief 376, Read Data and Bit Flip Register 11 */
#define MTU_MC3_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061376u)

/** \brief 378, Read Data and Bit Flip Register 12 */
#define MTU_MC3_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061378u)

/** \brief 37A, Read Data and Bit Flip Register 13 */
#define MTU_MC3_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006137Au)

/** \brief 37C, Read Data and Bit Flip Register 14 */
#define MTU_MC3_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006137Cu)

/** \brief 37E, Read Data and Bit Flip Register 15 */
#define MTU_MC3_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006137Eu)

/** \brief 380, Read Data and Bit Flip Register 16 */
#define MTU_MC3_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061380u)

/** \brief 382, Read Data and Bit Flip Register 17 */
#define MTU_MC3_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061382u)

/** \brief 384, Read Data and Bit Flip Register 18 */
#define MTU_MC3_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061384u)

/** \brief 386, Read Data and Bit Flip Register 19 */
#define MTU_MC3_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061386u)

/** \brief 388, Read Data and Bit Flip Register 20 */
#define MTU_MC3_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061388u)

/** \brief 38A, Read Data and Bit Flip Register 21 */
#define MTU_MC3_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006138Au)

/** \brief 38C, Read Data and Bit Flip Register 22 */
#define MTU_MC3_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006138Cu)

/** \brief 38E, Read Data and Bit Flip Register 23 */
#define MTU_MC3_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006138Eu)

/** \brief 390, Read Data and Bit Flip Register 24 */
#define MTU_MC3_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061390u)

/** \brief 392, Read Data and Bit Flip Register 25 */
#define MTU_MC3_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061392u)

/** \brief 394, Read Data and Bit Flip Register 26 */
#define MTU_MC3_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061394u)

/** \brief 396, Read Data and Bit Flip Register 27 */
#define MTU_MC3_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061396u)

/** \brief 398, Read Data and Bit Flip Register 28 */
#define MTU_MC3_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061398u)

/** \brief 39A, Read Data and Bit Flip Register 29 */
#define MTU_MC3_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006139Au)

/** \brief 39C, Read Data and Bit Flip Register 30 */
#define MTU_MC3_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006139Cu)

/** \brief 39E, Read Data and Bit Flip Register 31 */
#define MTU_MC3_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006139Eu)

/** \brief 3A0, Read Data and Bit Flip Register 32 */
#define MTU_MC3_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A0u)

/** \brief 3A2, Read Data and Bit Flip Register 33 */
#define MTU_MC3_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A2u)

/** \brief 3A4, Read Data and Bit Flip Register 34 */
#define MTU_MC3_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A4u)

/** \brief 3A6, Read Data and Bit Flip Register 35 */
#define MTU_MC3_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A6u)

/** \brief 3A8, Read Data and Bit Flip Register 36 */
#define MTU_MC3_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613A8u)

/** \brief 3AA, Read Data and Bit Flip Register 37 */
#define MTU_MC3_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613AAu)

/** \brief 3AC, Read Data and Bit Flip Register 38 */
#define MTU_MC3_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613ACu)

/** \brief 3AE, Read Data and Bit Flip Register 39 */
#define MTU_MC3_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613AEu)

/** \brief 3B0, Read Data and Bit Flip Register 40 */
#define MTU_MC3_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B0u)

/** \brief 3B2, Read Data and Bit Flip Register 41 */
#define MTU_MC3_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B2u)

/** \brief 3B4, Read Data and Bit Flip Register 42 */
#define MTU_MC3_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B4u)

/** \brief 3B6, Read Data and Bit Flip Register 43 */
#define MTU_MC3_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00613B6u)

