weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxMtu_reg.h
/** \brief 564, Read Data and Bit Flip Register 2 */
#define MTU_MC5_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061564u)

/** \brief 566, Read Data and Bit Flip Register 3 */
#define MTU_MC5_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061566u)

/** \brief 568, Read Data and Bit Flip Register 4 */
#define MTU_MC5_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061568u)

/** \brief 56A, Read Data and Bit Flip Register 5 */
#define MTU_MC5_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006156Au)

/** \brief 56C, Read Data and Bit Flip Register 6 */
#define MTU_MC5_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006156Cu)

/** \brief 56E, Read Data and Bit Flip Register 7 */
#define MTU_MC5_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006156Eu)

/** \brief 570, Read Data and Bit Flip Register 8 */
#define MTU_MC5_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061570u)

/** \brief 572, Read Data and Bit Flip Register 9 */
#define MTU_MC5_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061572u)

/** \brief 574, Read Data and Bit Flip Register 10 */
#define MTU_MC5_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061574u)

/** \brief 576, Read Data and Bit Flip Register 11 */
#define MTU_MC5_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061576u)

/** \brief 578, Read Data and Bit Flip Register 12 */
#define MTU_MC5_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061578u)

/** \brief 57A, Read Data and Bit Flip Register 13 */
#define MTU_MC5_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006157Au)

/** \brief 57C, Read Data and Bit Flip Register 14 */
#define MTU_MC5_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006157Cu)

/** \brief 57E, Read Data and Bit Flip Register 15 */
#define MTU_MC5_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006157Eu)

/** \brief 580, Read Data and Bit Flip Register 16 */
#define MTU_MC5_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061580u)

/** \brief 582, Read Data and Bit Flip Register 17 */
#define MTU_MC5_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061582u)

/** \brief 584, Read Data and Bit Flip Register 18 */
#define MTU_MC5_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061584u)

/** \brief 586, Read Data and Bit Flip Register 19 */
#define MTU_MC5_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061586u)

/** \brief 588, Read Data and Bit Flip Register 20 */
#define MTU_MC5_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061588u)

/** \brief 58A, Read Data and Bit Flip Register 21 */
#define MTU_MC5_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006158Au)

/** \brief 58C, Read Data and Bit Flip Register 22 */
#define MTU_MC5_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006158Cu)

/** \brief 58E, Read Data and Bit Flip Register 23 */
#define MTU_MC5_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006158Eu)

/** \brief 590, Read Data and Bit Flip Register 24 */
#define MTU_MC5_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061590u)

/** \brief 592, Read Data and Bit Flip Register 25 */
#define MTU_MC5_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061592u)

/** \brief 594, Read Data and Bit Flip Register 26 */
#define MTU_MC5_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061594u)

/** \brief 596, Read Data and Bit Flip Register 27 */
#define MTU_MC5_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061596u)

/** \brief 598, Read Data and Bit Flip Register 28 */
#define MTU_MC5_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061598u)

/** \brief 59A, Read Data and Bit Flip Register 29 */
#define MTU_MC5_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006159Au)

/** \brief 59C, Read Data and Bit Flip Register 30 */
#define MTU_MC5_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006159Cu)

/** \brief 59E, Read Data and Bit Flip Register 31 */
#define MTU_MC5_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006159Eu)

/** \brief 5A0, Read Data and Bit Flip Register 32 */
#define MTU_MC5_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A0u)

/** \brief 5A2, Read Data and Bit Flip Register 33 */
#define MTU_MC5_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A2u)

/** \brief 5A4, Read Data and Bit Flip Register 34 */
#define MTU_MC5_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A4u)

/** \brief 5A6, Read Data and Bit Flip Register 35 */
#define MTU_MC5_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A6u)

/** \brief 5A8, Read Data and Bit Flip Register 36 */
#define MTU_MC5_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615A8u)

/** \brief 5AA, Read Data and Bit Flip Register 37 */
#define MTU_MC5_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615AAu)

/** \brief 5AC, Read Data and Bit Flip Register 38 */
#define MTU_MC5_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615ACu)

/** \brief 5AE, Read Data and Bit Flip Register 39 */
#define MTU_MC5_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615AEu)

/** \brief 5B0, Read Data and Bit Flip Register 40 */
#define MTU_MC5_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B0u)

/** \brief 5B2, Read Data and Bit Flip Register 41 */
#define MTU_MC5_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B2u)

/** \brief 5B4, Read Data and Bit Flip Register 42 */
#define MTU_MC5_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B4u)

/** \brief 5B6, Read Data and Bit Flip Register 43 */
#define MTU_MC5_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B6u)

/** \brief 5B8, Read Data and Bit Flip Register 44 */
#define MTU_MC5_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615B8u)

/** \brief 5BA, Read Data and Bit Flip Register 45 */
#define MTU_MC5_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615BAu)

/** \brief 5BC, Read Data and Bit Flip Register 46 */
#define MTU_MC5_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615BCu)

/** \brief 5BE, Read Data and Bit Flip Register 47 */
#define MTU_MC5_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615BEu)

