weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxMtu_reg.h
/** \brief 1A60, Read Data and Bit Flip Register 0 */
#define MTU_MC26_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A60u)

/** \brief 1A62, Read Data and Bit Flip Register 1 */
#define MTU_MC26_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A62u)

/** \brief 1A64, Read Data and Bit Flip Register 2 */
#define MTU_MC26_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A64u)

/** \brief 1A66, Read Data and Bit Flip Register 3 */
#define MTU_MC26_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A66u)

/** \brief 1A68, Read Data and Bit Flip Register 4 */
#define MTU_MC26_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A68u)

/** \brief 1A6A, Read Data and Bit Flip Register 5 */
#define MTU_MC26_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A6Au)

/** \brief 1A6C, Read Data and Bit Flip Register 6 */
#define MTU_MC26_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A6Cu)

/** \brief 1A6E, Read Data and Bit Flip Register 7 */
#define MTU_MC26_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A6Eu)

/** \brief 1A70, Read Data and Bit Flip Register 8 */
#define MTU_MC26_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A70u)

/** \brief 1A72, Read Data and Bit Flip Register 9 */
#define MTU_MC26_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A72u)

/** \brief 1A74, Read Data and Bit Flip Register 10 */
#define MTU_MC26_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A74u)

/** \brief 1A76, Read Data and Bit Flip Register 11 */
#define MTU_MC26_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A76u)

/** \brief 1A78, Read Data and Bit Flip Register 12 */
#define MTU_MC26_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A78u)

/** \brief 1A7A, Read Data and Bit Flip Register 13 */
#define MTU_MC26_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A7Au)

/** \brief 1A7C, Read Data and Bit Flip Register 14 */
#define MTU_MC26_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A7Cu)

/** \brief 1A7E, Read Data and Bit Flip Register 15 */
#define MTU_MC26_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A7Eu)

/** \brief 1A80, Read Data and Bit Flip Register 16 */
#define MTU_MC26_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A80u)

/** \brief 1A82, Read Data and Bit Flip Register 17 */
#define MTU_MC26_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A82u)

/** \brief 1A84, Read Data and Bit Flip Register 18 */
#define MTU_MC26_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A84u)

/** \brief 1A86, Read Data and Bit Flip Register 19 */
#define MTU_MC26_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A86u)

/** \brief 1A88, Read Data and Bit Flip Register 20 */
#define MTU_MC26_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A88u)

/** \brief 1A8A, Read Data and Bit Flip Register 21 */
#define MTU_MC26_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A8Au)

/** \brief 1A8C, Read Data and Bit Flip Register 22 */
#define MTU_MC26_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A8Cu)

/** \brief 1A8E, Read Data and Bit Flip Register 23 */
#define MTU_MC26_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A8Eu)

/** \brief 1A90, Read Data and Bit Flip Register 24 */
#define MTU_MC26_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A90u)

/** \brief 1A92, Read Data and Bit Flip Register 25 */
#define MTU_MC26_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A92u)

/** \brief 1A94, Read Data and Bit Flip Register 26 */
#define MTU_MC26_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A94u)

/** \brief 1A96, Read Data and Bit Flip Register 27 */
#define MTU_MC26_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A96u)

/** \brief 1A98, Read Data and Bit Flip Register 28 */
#define MTU_MC26_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A98u)

/** \brief 1A9A, Read Data and Bit Flip Register 29 */
#define MTU_MC26_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A9Au)

/** \brief 1A9C, Read Data and Bit Flip Register 30 */
#define MTU_MC26_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A9Cu)

/** \brief 1A9E, Read Data and Bit Flip Register 31 */
#define MTU_MC26_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062A9Eu)

/** \brief 1AA0, Read Data and Bit Flip Register 32 */
#define MTU_MC26_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA0u)

/** \brief 1AA2, Read Data and Bit Flip Register 33 */
#define MTU_MC26_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA2u)

/** \brief 1AA4, Read Data and Bit Flip Register 34 */
#define MTU_MC26_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA4u)

/** \brief 1AA6, Read Data and Bit Flip Register 35 */
#define MTU_MC26_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA6u)

/** \brief 1AA8, Read Data and Bit Flip Register 36 */
#define MTU_MC26_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AA8u)

/** \brief 1AAA, Read Data and Bit Flip Register 37 */
#define MTU_MC26_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AAAu)

/** \brief 1AAC, Read Data and Bit Flip Register 38 */
#define MTU_MC26_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AACu)

/** \brief 1AAE, Read Data and Bit Flip Register 39 */
#define MTU_MC26_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AAEu)

/** \brief 1AB0, Read Data and Bit Flip Register 40 */
#define MTU_MC26_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB0u)

/** \brief 1AB2, Read Data and Bit Flip Register 41 */
#define MTU_MC26_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB2u)

/** \brief 1AB4, Read Data and Bit Flip Register 42 */
#define MTU_MC26_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB4u)

/** \brief 1AB6, Read Data and Bit Flip Register 43 */
#define MTU_MC26_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB6u)

/** \brief 1AB8, Read Data and Bit Flip Register 44 */
#define MTU_MC26_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AB8u)

/** \brief 1ABA, Read Data and Bit Flip Register 45 */
#define MTU_MC26_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ABAu)

