weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxMtu_reg.h
/** \brief 1ABC, Read Data and Bit Flip Register 46 */
#define MTU_MC26_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ABCu)

/** \brief 1ABE, Read Data and Bit Flip Register 47 */
#define MTU_MC26_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ABEu)

/** \brief 1AC0, Read Data and Bit Flip Register 48 */
#define MTU_MC26_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC0u)

/** \brief 1AC2, Read Data and Bit Flip Register 49 */
#define MTU_MC26_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC2u)

/** \brief 1AC4, Read Data and Bit Flip Register 50 */
#define MTU_MC26_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC4u)

/** \brief 1AC6, Read Data and Bit Flip Register 51 */
#define MTU_MC26_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC6u)

/** \brief 1AC8, Read Data and Bit Flip Register 52 */
#define MTU_MC26_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AC8u)

/** \brief 1ACA, Read Data and Bit Flip Register 53 */
#define MTU_MC26_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ACAu)

/** \brief 1ACC, Read Data and Bit Flip Register 54 */
#define MTU_MC26_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ACCu)

/** \brief 1ACE, Read Data and Bit Flip Register 55 */
#define MTU_MC26_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ACEu)

/** \brief 1AD0, Read Data and Bit Flip Register 56 */
#define MTU_MC26_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD0u)

/** \brief 1AD2, Read Data and Bit Flip Register 57 */
#define MTU_MC26_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD2u)

/** \brief 1AD4, Read Data and Bit Flip Register 58 */
#define MTU_MC26_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD4u)

/** \brief 1AD6, Read Data and Bit Flip Register 59 */
#define MTU_MC26_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD6u)

/** \brief 1AD8, Read Data and Bit Flip Register 60 */
#define MTU_MC26_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AD8u)

/** \brief 1ADA, Read Data and Bit Flip Register 61 */
#define MTU_MC26_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ADAu)

/** \brief 1ADC, Read Data and Bit Flip Register 62 */
#define MTU_MC26_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ADCu)

/** \brief 1ADE, Read Data and Bit Flip Register 63 */
#define MTU_MC26_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ADEu)

/** \brief 1AE0, Read Data and Bit Flip Register 64 */
#define MTU_MC26_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AE0u)

/** \brief 1AE2, Read Data and Bit Flip Register 65 */
#define MTU_MC26_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AE2u)

/** \brief 1AE4, Read Data and Bit Flip Register 66 */
#define MTU_MC26_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062AE4u)

/** \brief 1AEE, Alarm Sources Configuration Register */
#define MTU_MC26_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0062AEEu)

/** \brief 1AF0, SSH Safety Faults Status Register  */
#define MTU_MC26_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0062AF0u)

/** \brief 1AF2, Error Information Register 0 */
#define MTU_MC26_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AF2u)

/** \brief 1AF4, Error Information Register 1 */
#define MTU_MC26_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AF4u)

/** \brief 1AF6, Error Information Register 2 */
#define MTU_MC26_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AF6u)

/** \brief 1AF8, Error Information Register 3 */
#define MTU_MC26_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AF8u)

/** \brief 1AFA, Error Information Register 4 */
#define MTU_MC26_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062AFAu)

/** \brief 1B00, Configuration Registers */
#define MTU_MC27_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062B00u)

/** \brief 1B02, Configuration Register 1 */
#define MTU_MC27_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062B02u)

/** \brief 1B04, MBIST Control Register */
#define MTU_MC27_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062B04u)

/** \brief 1B06, Status Register */
#define MTU_MC27_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062B06u)

/** \brief 1B08, Range Register, single address mode */
#define MTU_MC27_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062B08u)

/** \brief 1B0C, Revision ID Register */
#define MTU_MC27_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0062B0Cu)

/** \brief 1B0E, ECC Safety Register */
#define MTU_MC27_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0062B0Eu)

/** \brief 1B10, Memory ECC Detection Register */
#define MTU_MC27_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062B10u)

/** \brief 1B12, Error Tracking Register 0 */
#define MTU_MC27_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062B12u)

/** \brief 1B14, Error Tracking Register 1 */
#define MTU_MC27_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062B14u)

/** \brief 1B16, Error Tracking Register 2 */
#define MTU_MC27_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062B16u)

/** \brief 1B18, Error Tracking Register 3 */
#define MTU_MC27_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062B18u)

/** \brief 1B1A, Error Tracking Register 4 */
#define MTU_MC27_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062B1Au)

/** \brief 1B60, Read Data and Bit Flip Register 0 */
#define MTU_MC27_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B60u)

/** \brief 1B62, Read Data and Bit Flip Register 1 */
#define MTU_MC27_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062B62u)

