weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxMtu_reg.h
/** \brief 2574, Read Data and Bit Flip Register 10 */
#define MTU_MC37_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063574u)

/** \brief 2576, Read Data and Bit Flip Register 11 */
#define MTU_MC37_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063576u)

/** \brief 2578, Read Data and Bit Flip Register 12 */
#define MTU_MC37_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063578u)

/** \brief 257A, Read Data and Bit Flip Register 13 */
#define MTU_MC37_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006357Au)

/** \brief 257C, Read Data and Bit Flip Register 14 */
#define MTU_MC37_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006357Cu)

/** \brief 257E, Read Data and Bit Flip Register 15 */
#define MTU_MC37_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006357Eu)

/** \brief 2580, Read Data and Bit Flip Register 16 */
#define MTU_MC37_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063580u)

/** \brief 2582, Read Data and Bit Flip Register 17 */
#define MTU_MC37_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063582u)

/** \brief 2584, Read Data and Bit Flip Register 18 */
#define MTU_MC37_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063584u)

/** \brief 2586, Read Data and Bit Flip Register 19 */
#define MTU_MC37_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063586u)

/** \brief 2588, Read Data and Bit Flip Register 20 */
#define MTU_MC37_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063588u)

/** \brief 258A, Read Data and Bit Flip Register 21 */
#define MTU_MC37_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006358Au)

/** \brief 258C, Read Data and Bit Flip Register 22 */
#define MTU_MC37_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006358Cu)

/** \brief 258E, Read Data and Bit Flip Register 23 */
#define MTU_MC37_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006358Eu)

/** \brief 2590, Read Data and Bit Flip Register 24 */
#define MTU_MC37_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063590u)

/** \brief 2592, Read Data and Bit Flip Register 25 */
#define MTU_MC37_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063592u)

/** \brief 2594, Read Data and Bit Flip Register 26 */
#define MTU_MC37_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063594u)

/** \brief 2596, Read Data and Bit Flip Register 27 */
#define MTU_MC37_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063596u)

/** \brief 2598, Read Data and Bit Flip Register 28 */
#define MTU_MC37_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063598u)

/** \brief 259A, Read Data and Bit Flip Register 29 */
#define MTU_MC37_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006359Au)

/** \brief 259C, Read Data and Bit Flip Register 30 */
#define MTU_MC37_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006359Cu)

/** \brief 259E, Read Data and Bit Flip Register 31 */
#define MTU_MC37_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006359Eu)

/** \brief 25A0, Read Data and Bit Flip Register 32 */
#define MTU_MC37_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A0u)

/** \brief 25A2, Read Data and Bit Flip Register 33 */
#define MTU_MC37_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A2u)

/** \brief 25A4, Read Data and Bit Flip Register 34 */
#define MTU_MC37_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A4u)

/** \brief 25A6, Read Data and Bit Flip Register 35 */
#define MTU_MC37_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A6u)

/** \brief 25A8, Read Data and Bit Flip Register 36 */
#define MTU_MC37_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635A8u)

/** \brief 25AA, Read Data and Bit Flip Register 37 */
#define MTU_MC37_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635AAu)

/** \brief 25AC, Read Data and Bit Flip Register 38 */
#define MTU_MC37_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635ACu)

/** \brief 25AE, Read Data and Bit Flip Register 39 */
#define MTU_MC37_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635AEu)

/** \brief 25B0, Read Data and Bit Flip Register 40 */
#define MTU_MC37_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B0u)

/** \brief 25B2, Read Data and Bit Flip Register 41 */
#define MTU_MC37_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B2u)

/** \brief 25B4, Read Data and Bit Flip Register 42 */
#define MTU_MC37_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B4u)

/** \brief 25B6, Read Data and Bit Flip Register 43 */
#define MTU_MC37_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B6u)

/** \brief 25B8, Read Data and Bit Flip Register 44 */
#define MTU_MC37_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635B8u)

/** \brief 25BA, Read Data and Bit Flip Register 45 */
#define MTU_MC37_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635BAu)

/** \brief 25BC, Read Data and Bit Flip Register 46 */
#define MTU_MC37_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635BCu)

/** \brief 25BE, Read Data and Bit Flip Register 47 */
#define MTU_MC37_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635BEu)

/** \brief 25C0, Read Data and Bit Flip Register 48 */
#define MTU_MC37_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C0u)

/** \brief 25C2, Read Data and Bit Flip Register 49 */
#define MTU_MC37_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C2u)

/** \brief 25C4, Read Data and Bit Flip Register 50 */
#define MTU_MC37_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C4u)

/** \brief 25C6, Read Data and Bit Flip Register 51 */
#define MTU_MC37_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C6u)

