weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxMtu_reg.h
/** \brief 3866, Read Data and Bit Flip Register 3 */
#define MTU_MC56_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064866u)

/** \brief 3868, Read Data and Bit Flip Register 4 */
#define MTU_MC56_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064868u)

/** \brief 386A, Read Data and Bit Flip Register 5 */
#define MTU_MC56_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006486Au)

/** \brief 386C, Read Data and Bit Flip Register 6 */
#define MTU_MC56_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006486Cu)

/** \brief 386E, Read Data and Bit Flip Register 7 */
#define MTU_MC56_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006486Eu)

/** \brief 3870, Read Data and Bit Flip Register 8 */
#define MTU_MC56_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064870u)

/** \brief 3872, Read Data and Bit Flip Register 9 */
#define MTU_MC56_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064872u)

/** \brief 3874, Read Data and Bit Flip Register 10 */
#define MTU_MC56_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064874u)

/** \brief 3876, Read Data and Bit Flip Register 11 */
#define MTU_MC56_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064876u)

/** \brief 3878, Read Data and Bit Flip Register 12 */
#define MTU_MC56_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064878u)

/** \brief 387A, Read Data and Bit Flip Register 13 */
#define MTU_MC56_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006487Au)

/** \brief 387C, Read Data and Bit Flip Register 14 */
#define MTU_MC56_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006487Cu)

/** \brief 387E, Read Data and Bit Flip Register 15 */
#define MTU_MC56_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006487Eu)

/** \brief 3880, Read Data and Bit Flip Register 16 */
#define MTU_MC56_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064880u)

/** \brief 3882, Read Data and Bit Flip Register 17 */
#define MTU_MC56_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064882u)

/** \brief 3884, Read Data and Bit Flip Register 18 */
#define MTU_MC56_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064884u)

/** \brief 3886, Read Data and Bit Flip Register 19 */
#define MTU_MC56_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064886u)

/** \brief 3888, Read Data and Bit Flip Register 20 */
#define MTU_MC56_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064888u)

/** \brief 388A, Read Data and Bit Flip Register 21 */
#define MTU_MC56_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006488Au)

/** \brief 388C, Read Data and Bit Flip Register 22 */
#define MTU_MC56_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006488Cu)

/** \brief 388E, Read Data and Bit Flip Register 23 */
#define MTU_MC56_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006488Eu)

/** \brief 3890, Read Data and Bit Flip Register 24 */
#define MTU_MC56_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064890u)

/** \brief 3892, Read Data and Bit Flip Register 25 */
#define MTU_MC56_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064892u)

/** \brief 3894, Read Data and Bit Flip Register 26 */
#define MTU_MC56_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064894u)

/** \brief 3896, Read Data and Bit Flip Register 27 */
#define MTU_MC56_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064896u)

/** \brief 3898, Read Data and Bit Flip Register 28 */
#define MTU_MC56_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064898u)

/** \brief 389A, Read Data and Bit Flip Register 29 */
#define MTU_MC56_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006489Au)

/** \brief 389C, Read Data and Bit Flip Register 30 */
#define MTU_MC56_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006489Cu)

/** \brief 389E, Read Data and Bit Flip Register 31 */
#define MTU_MC56_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006489Eu)

/** \brief 38A0, Read Data and Bit Flip Register 32 */
#define MTU_MC56_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A0u)

/** \brief 38A2, Read Data and Bit Flip Register 33 */
#define MTU_MC56_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A2u)

/** \brief 38A4, Read Data and Bit Flip Register 34 */
#define MTU_MC56_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A4u)

/** \brief 38A6, Read Data and Bit Flip Register 35 */
#define MTU_MC56_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A6u)

/** \brief 38A8, Read Data and Bit Flip Register 36 */
#define MTU_MC56_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648A8u)

/** \brief 38AA, Read Data and Bit Flip Register 37 */
#define MTU_MC56_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648AAu)

/** \brief 38AC, Read Data and Bit Flip Register 38 */
#define MTU_MC56_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648ACu)

/** \brief 38AE, Read Data and Bit Flip Register 39 */
#define MTU_MC56_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648AEu)

/** \brief 38B0, Read Data and Bit Flip Register 40 */
#define MTU_MC56_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B0u)

/** \brief 38B2, Read Data and Bit Flip Register 41 */
#define MTU_MC56_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B2u)

/** \brief 38B4, Read Data and Bit Flip Register 42 */
#define MTU_MC56_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B4u)

/** \brief 38B6, Read Data and Bit Flip Register 43 */
#define MTU_MC56_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B6u)

