weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxMtu_reg.h
/** \brief 4BA6, Read Data and Bit Flip Register 35 */
#define MTU_MC75_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA6u)

/** \brief 4BA8, Read Data and Bit Flip Register 36 */
#define MTU_MC75_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BA8u)

/** \brief 4BAA, Read Data and Bit Flip Register 37 */
#define MTU_MC75_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BAAu)

/** \brief 4BAC, Read Data and Bit Flip Register 38 */
#define MTU_MC75_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BACu)

/** \brief 4BAE, Read Data and Bit Flip Register 39 */
#define MTU_MC75_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BAEu)

/** \brief 4BB0, Read Data and Bit Flip Register 40 */
#define MTU_MC75_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB0u)

/** \brief 4BB2, Read Data and Bit Flip Register 41 */
#define MTU_MC75_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB2u)

/** \brief 4BB4, Read Data and Bit Flip Register 42 */
#define MTU_MC75_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB4u)

/** \brief 4BB6, Read Data and Bit Flip Register 43 */
#define MTU_MC75_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB6u)

/** \brief 4BB8, Read Data and Bit Flip Register 44 */
#define MTU_MC75_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BB8u)

/** \brief 4BBA, Read Data and Bit Flip Register 45 */
#define MTU_MC75_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BBAu)

/** \brief 4BBC, Read Data and Bit Flip Register 46 */
#define MTU_MC75_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BBCu)

/** \brief 4BBE, Read Data and Bit Flip Register 47 */
#define MTU_MC75_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BBEu)

/** \brief 4BC0, Read Data and Bit Flip Register 48 */
#define MTU_MC75_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC0u)

/** \brief 4BC2, Read Data and Bit Flip Register 49 */
#define MTU_MC75_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC2u)

/** \brief 4BC4, Read Data and Bit Flip Register 50 */
#define MTU_MC75_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC4u)

/** \brief 4BC6, Read Data and Bit Flip Register 51 */
#define MTU_MC75_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC6u)

/** \brief 4BC8, Read Data and Bit Flip Register 52 */
#define MTU_MC75_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BC8u)

/** \brief 4BCA, Read Data and Bit Flip Register 53 */
#define MTU_MC75_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BCAu)

/** \brief 4BCC, Read Data and Bit Flip Register 54 */
#define MTU_MC75_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BCCu)

/** \brief 4BCE, Read Data and Bit Flip Register 55 */
#define MTU_MC75_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BCEu)

/** \brief 4BD0, Read Data and Bit Flip Register 56 */
#define MTU_MC75_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD0u)

/** \brief 4BD2, Read Data and Bit Flip Register 57 */
#define MTU_MC75_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD2u)

/** \brief 4BD4, Read Data and Bit Flip Register 58 */
#define MTU_MC75_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD4u)

/** \brief 4BD6, Read Data and Bit Flip Register 59 */
#define MTU_MC75_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD6u)

/** \brief 4BD8, Read Data and Bit Flip Register 60 */
#define MTU_MC75_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BD8u)

/** \brief 4BDA, Read Data and Bit Flip Register 61 */
#define MTU_MC75_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BDAu)

/** \brief 4BDC, Read Data and Bit Flip Register 62 */
#define MTU_MC75_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BDCu)

/** \brief 4BDE, Read Data and Bit Flip Register 63 */
#define MTU_MC75_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BDEu)

/** \brief 4BE0, Read Data and Bit Flip Register 64 */
#define MTU_MC75_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BE0u)

/** \brief 4BE2, Read Data and Bit Flip Register 65 */
#define MTU_MC75_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BE2u)

/** \brief 4BE4, Read Data and Bit Flip Register 66 */
#define MTU_MC75_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065BE4u)

/** \brief 4BEE, Alarm Sources Configuration Register */
#define MTU_MC75_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0065BEEu)

/** \brief 4BF0, SSH Safety Faults Status Register  */
#define MTU_MC75_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0065BF0u)

/** \brief 4BF2, Error Information Register 0 */
#define MTU_MC75_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065BF2u)

/** \brief 4BF4, Error Information Register 1 */
#define MTU_MC75_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065BF4u)

/** \brief 4BF6, Error Information Register 2 */
#define MTU_MC75_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065BF6u)

/** \brief 4BF8, Error Information Register 3 */
#define MTU_MC75_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065BF8u)

/** \brief 4BFA, Error Information Register 4 */
#define MTU_MC75_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065BFAu)

/** \brief 4C00, Configuration Registers */
#define MTU_MC76_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065C00u)

/** \brief 4C02, Configuration Register 1 */
#define MTU_MC76_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065C02u)

