weifengdq/embedded/tc364/tc364_can_x8_gcc/Libraries/Infra/Sfr/TC36x/IfxMtu_reg.h
/** \brief 5260, Read Data and Bit Flip Register 0 */
#define MTU_MC82_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066260u)

/** \brief 5262, Read Data and Bit Flip Register 1 */
#define MTU_MC82_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066262u)

/** \brief 5264, Read Data and Bit Flip Register 2 */
#define MTU_MC82_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066264u)

/** \brief 5266, Read Data and Bit Flip Register 3 */
#define MTU_MC82_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066266u)

/** \brief 5268, Read Data and Bit Flip Register 4 */
#define MTU_MC82_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066268u)

/** \brief 526A, Read Data and Bit Flip Register 5 */
#define MTU_MC82_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006626Au)

/** \brief 526C, Read Data and Bit Flip Register 6 */
#define MTU_MC82_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006626Cu)

/** \brief 526E, Read Data and Bit Flip Register 7 */
#define MTU_MC82_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006626Eu)

/** \brief 5270, Read Data and Bit Flip Register 8 */
#define MTU_MC82_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066270u)

/** \brief 5272, Read Data and Bit Flip Register 9 */
#define MTU_MC82_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066272u)

/** \brief 5274, Read Data and Bit Flip Register 10 */
#define MTU_MC82_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066274u)

/** \brief 5276, Read Data and Bit Flip Register 11 */
#define MTU_MC82_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066276u)

/** \brief 5278, Read Data and Bit Flip Register 12 */
#define MTU_MC82_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066278u)

/** \brief 527A, Read Data and Bit Flip Register 13 */
#define MTU_MC82_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006627Au)

/** \brief 527C, Read Data and Bit Flip Register 14 */
#define MTU_MC82_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006627Cu)

/** \brief 527E, Read Data and Bit Flip Register 15 */
#define MTU_MC82_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006627Eu)

/** \brief 5280, Read Data and Bit Flip Register 16 */
#define MTU_MC82_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066280u)

/** \brief 5282, Read Data and Bit Flip Register 17 */
#define MTU_MC82_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066282u)

/** \brief 5284, Read Data and Bit Flip Register 18 */
#define MTU_MC82_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066284u)

/** \brief 5286, Read Data and Bit Flip Register 19 */
#define MTU_MC82_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066286u)

/** \brief 5288, Read Data and Bit Flip Register 20 */
#define MTU_MC82_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066288u)

/** \brief 528A, Read Data and Bit Flip Register 21 */
#define MTU_MC82_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006628Au)

/** \brief 528C, Read Data and Bit Flip Register 22 */
#define MTU_MC82_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006628Cu)

/** \brief 528E, Read Data and Bit Flip Register 23 */
#define MTU_MC82_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006628Eu)

/** \brief 5290, Read Data and Bit Flip Register 24 */
#define MTU_MC82_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066290u)

/** \brief 5292, Read Data and Bit Flip Register 25 */
#define MTU_MC82_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066292u)

/** \brief 5294, Read Data and Bit Flip Register 26 */
#define MTU_MC82_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066294u)

/** \brief 5296, Read Data and Bit Flip Register 27 */
#define MTU_MC82_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066296u)

/** \brief 5298, Read Data and Bit Flip Register 28 */
#define MTU_MC82_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066298u)

/** \brief 529A, Read Data and Bit Flip Register 29 */
#define MTU_MC82_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006629Au)

/** \brief 529C, Read Data and Bit Flip Register 30 */
#define MTU_MC82_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006629Cu)

/** \brief 529E, Read Data and Bit Flip Register 31 */
#define MTU_MC82_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006629Eu)

/** \brief 52A0, Read Data and Bit Flip Register 32 */
#define MTU_MC82_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A0u)

/** \brief 52A2, Read Data and Bit Flip Register 33 */
#define MTU_MC82_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A2u)

/** \brief 52A4, Read Data and Bit Flip Register 34 */
#define MTU_MC82_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A4u)

/** \brief 52A6, Read Data and Bit Flip Register 35 */
#define MTU_MC82_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A6u)

/** \brief 52A8, Read Data and Bit Flip Register 36 */
#define MTU_MC82_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662A8u)

/** \brief 52AA, Read Data and Bit Flip Register 37 */
#define MTU_MC82_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662AAu)

/** \brief 52AC, Read Data and Bit Flip Register 38 */
#define MTU_MC82_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662ACu)

/** \brief 52AE, Read Data and Bit Flip Register 39 */
#define MTU_MC82_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662AEu)

/** \brief 52B0, Read Data and Bit Flip Register 40 */
#define MTU_MC82_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B0u)

/** \brief 52B2, Read Data and Bit Flip Register 41 */
#define MTU_MC82_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B2u)

/** \brief 52B4, Read Data and Bit Flip Register 42 */
#define MTU_MC82_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B4u)

/** \brief 52B6, Read Data and Bit Flip Register 43 */
#define MTU_MC82_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B6u)

/** \brief 52B8, Read Data and Bit Flip Register 44 */
#define MTU_MC82_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662B8u)

/** \brief 52BA, Read Data and Bit Flip Register 45 */
#define MTU_MC82_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00662BAu)

